# SetColumnWidthInPixels Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..SetColumnWidthInPixels Method
TableSectionData Class See Also
---
This sets a column's width in logical pixels
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetColumnWidthInPixels(
	int nCol,
	int width
)
```

Visual Basic
---
```text
Public Sub SetColumnWidthInPixels ( _
	nCol As Integer, _
	width As Integer _
)
```

Visual C++
---
```text
public:
void SetColumnWidthInPixels(
	int nCol,
	int width
)
```

# ### Parameters
nCol
    Type: System..::..Int32
width
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. -or- The column width is outside of acceptable range. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace